; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	spectrograph2 - mode
	image1 - mode
	image0 - mode
	Star1 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation3 - direction
	GroundStation2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 spectrograph2)
	(supports instrument3 image1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument5 image1)
	(supports instrument5 spectrograph2)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 image1)
	(supports instrument6 image0)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 spectrograph2)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(have_image Star5 image0)
	(have_image Phenomenon6 image0)
	(have_image Phenomenon7 image1)
	(have_image Phenomenon8 image1)
	(have_image Planet9 image1)
	(have_image Planet10 image0)
	(have_image Star11 image1)
	(have_image Phenomenon12 image0)
	(have_image Star13 spectrograph2)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 9
2. (calibrate satellite2 instrument5 groundstation0)
   added: (calibrated instrument5)
   goals met: 0 of 9
3. (turn_to satellite2 planet10 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet10)
   goals met: 0 of 9
4. (take_image satellite2 planet10 instrument5 image0)
   added: (have_image planet10 image0)
   goals met: 1 of 9
5. (turn_to satellite2 phenomenon8 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon8)
   goals met: 1 of 9
6. (take_image satellite2 phenomenon8 instrument5 image1)
   added: (have_image phenomenon8 image1)
   goals met: 2 of 9
7. (turn_to satellite2 phenomenon7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 phenomenon7)
   goals met: 2 of 9
8. (take_image satellite2 phenomenon7 instrument5 image1)
   added: (have_image phenomenon7 image1)
   goals met: 3 of 9
9. (turn_to satellite2 phenomenon6 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 phenomenon6)
   goals met: 3 of 9
10. (take_image satellite2 phenomenon6 instrument5 image0)
   added: (have_image phenomenon6 image0)
   goals met: 4 of 9
11. (turn_to satellite2 phenomenon12 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon12)
   goals met: 4 of 9
12. (take_image satellite2 phenomenon12 instrument5 image0)
   added: (have_image phenomenon12 image0)
   goals met: 5 of 9
13. (turn_to satellite2 planet9 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 planet9)
   goals met: 5 of 9
14. (take_image satellite2 planet9 instrument5 image1)
   added: (have_image planet9 image1)
   goals met: 6 of 9
15. (turn_to satellite2 star11 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star11)
   goals met: 6 of 9
16. (take_image satellite2 star11 instrument5 image1)
   added: (have_image star11 image1)
   goals met: 7 of 9
17. (turn_to satellite2 star13 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star13)
   goals met: 7 of 9
18. (take_image satellite2 star13 instrument5 spectrograph2)
   added: (have_image star13 spectrograph2)
   goals met: 8 of 9
19. (turn_to satellite2 star5 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star5)
   goals met: 8 of 9
20. (take_image satellite2 star5 instrument5 image0)
   added: (have_image star5 image0)
   goals met: 9 of 9
